# RbsElecPanelTotalloadHvacParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecPanelTotalloadHvacParam Property
ParameterTypeId Class See Also
---
"HVAC Total Connected"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecPanelTotalloadHvacParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecPanelTotalloadHvacParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecPanelTotalloadHvacParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace